---
kind: property
id: P:Autodesk.Revit.DB.Visual.Ceramic.CeramicType
source: html/36cd8dc5-53af-3822-7fe1-cb24b48fc81d.htm
---
# Autodesk.Revit.DB.Visual.Ceramic.CeramicType Property

The property labeled "Type" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public static string CeramicType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicType".